### 1. Series
    - 동일한 데이터 타입을 갖는다

In [5]:
# Series : value만 설정하면 index는 0부터 자동으로 설정됨
data = pd.Series(np.random.randint(10, size=5))
data

0    2
1    1
2    6
3    2
4    2
dtype: int32

In [6]:
#index 설정
data = pd.Series(np.random.randint(10,size=5),
                index = list("ABCDE"))
data

A    3
B    7
C    2
D    4
E    1
dtype: int32

In [7]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([3, 7, 2, 4, 1]))

In [9]:
data["B"], data.B

(7, 7)

In [10]:
data["C"] = 10
data

A     3
B     7
C    10
D     4
E     1
dtype: int32

In [11]:
# 브로드 캐스팅
data * 10

A     30
B     70
C    100
D     40
E     10
dtype: int32

In [12]:
data[["B", "E"]]

B    7
E    1
dtype: int32

In [20]:
# offset index
data[2::2]

C    10
E     1
dtype: int32

In [21]:
data[::-1]

E     1
D     4
C    10
B     7
A     3
dtype: int32

In [22]:
# Series

In [23]:
data

A     3
B     7
C    10
D     4
E     1
dtype: int32

In [25]:
data2 = pd.Series({"D":3,"E":5, "F":7})
data2

D    3
E    5
F    7
dtype: int64

In [27]:
result = data + data2
result

A    NaN
B    NaN
C    NaN
D    7.0
E    6.0
F    NaN
dtype: float64

In [29]:
result[result.isnull()] = data
result

A     3.0
B     7.0
C    10.0
D     7.0
E     6.0
F     NaN
dtype: float64

In [30]:
result[result.isnull()] = data2
result

A     3.0
B     7.0
C    10.0
D     7.0
E     6.0
F     7.0
dtype: float64

### 2. DataFrame
   - 데이터 프레임은 여러개의 Series로 구성
   - 같은 컬럼에 있는 value값은 같은 데이터 타입

In [ ]:
# 데이터 프레임 생성 1 : 딕셔너리의 리스트

In [31]:
datas = {
    "name":["dss", "fcamp"],
    "email":["dss@gmail.com", "fcamp@daum.net"],
}
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@gmail.com', 'fcamp@daum.net']}

In [32]:
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@gmail.com
1  fcamp  fcamp@daum.net

In [ ]:
# 데이터 프레임 생성 2 : 리스트의 딕셔너리

In [34]:
datas = [
    {"name":"dss", "email":"dss@gmail.com"},
    {"name":"fcamp", "email":"fcamp@daum.net"}
]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'fcamp', 'email': 'fcamp@daum.net'}]

In [36]:
df = pd.DataFrame(datas)
df

            email   name
0   dss@gmail.com    dss
1  fcamp@daum.net  fcamp

In [37]:
# 인덱스를 추가하는 방법
df = pd.DataFrame(datas, index=["one","two"])
df

              email   name
one   dss@gmail.com    dss
two  fcamp@daum.net  fcamp

In [38]:
df.index

Index(['one', 'two'], dtype='object')

In [39]:
df.columns

Index(['email', 'name'], dtype='object')

In [40]:
df.values

array([['dss@gmail.com', 'dss'],
       ['fcamp@daum.net', 'fcamp']], dtype=object)

In [ ]:
# 데이터 프레임에서 데이터의 선택 : row, column, (row,column)

In [41]:
# row 선택 : loc
df = pd.DataFrame(datas)
df

            email   name
0   dss@gmail.com    dss
1  fcamp@daum.net  fcamp

In [42]:
df.loc[1]["email"]

'fcamp@daum.net'

In [43]:
# index가 있으면 수정, 없으면 추가
df.loc[2] = {"name":"andy", "email":"andy@naver.com"}
df

            email   name
0   dss@gmail.com    dss
1  fcamp@daum.net  fcamp
2  andy@naver.com   andy

In [44]:
# column 선택

In [45]:
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [46]:
df["id"] = ""
df

            email   name id
0   dss@gmail.com    dss
1  fcamp@daum.net  fcamp
2  andy@naver.com   andy

In [48]:
df["id"] = range(1,4)
df

            email   name  id
0   dss@gmail.com    dss   1
1  fcamp@daum.net  fcamp   2
2  andy@naver.com   andy   3

In [49]:
df.dtypes

email    object
name     object
id        int32
dtype: object

In [ ]:
# row, column 선택

In [50]:
df.loc[[0,2],["email","id"]]

            email  id
0   dss@gmail.com   1
2  andy@naver.com   3

In [51]:
# 컬럼 데이터 순서 설정

In [52]:
df[["id", "name", "email"]]

   id   name           email
0   1    dss   dss@gmail.com
1   2  fcamp  fcamp@daum.net
2   3   andy  andy@naver.com

In [53]:
# head, tail

In [54]:
df.head(2)

            email   name  id
0   dss@gmail.com    dss   1
1  fcamp@daum.net  fcamp   2

In [55]:
df.tail(2)

            email   name  id
1  fcamp@daum.net  fcamp   2
2  andy@naver.com   andy   3

### 3. apply함수
   - map 함수와 비슷

In [56]:
# email 컬럼에서 메일의 도메인만 가져와서 새로운 domain 컬럼을 생성
df

            email   name  id
0   dss@gmail.com    dss   1
1  fcamp@daum.net  fcamp   2
2  andy@naver.com   andy   3

In [69]:
# type1
def domain(email):
    return email.split("@")[1].split(".")[0]

domain(df.loc[0]["email"])

'gmail'

In [70]:
df["domain"] = df["email"].apply(domain)
df

            email   name  id domain
0   dss@gmail.com    dss   1  gmail
1  fcamp@daum.net  fcamp   2   daum
2  andy@naver.com   andy   3  naver

In [71]:
# type2
df["domain"] = df["email"].apply(lambda email: email.split("@")[1].split(".")[0])
df

            email   name  id domain
0   dss@gmail.com    dss   1  gmail
1  fcamp@daum.net  fcamp   2   daum
2  andy@naver.com   andy   3  naver

In [73]:
from makedata import *

In [96]:
get_age()
make_data()

[{'Age': 24, 'Name': 'Anthony'},
 {'Age': 35, 'Name': 'Anchal'},
 {'Age': 36, 'Name': 'Arnold'},
 {'Age': 38, 'Name': 'Alan'},
 {'Age': 37, 'Name': 'Alvin'},
 {'Age': 23, 'Name': 'Andrew'},
 {'Age': 29, 'Name': 'Alan'},
 {'Age': 23, 'Name': 'Anthony'},
 {'Age': 23, 'Name': 'Alvin'},
 {'Age': 35, 'Name': 'Alex'}]

In [78]:
df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))
df2

   Age    Name
0   32   Alvin
1   39   Billy
2   27   Alvin
3   31    Alex
4   28  Andrew

### 4. Append

In [79]:
# append 데이터 프레임 합치기
df3 = df1.append(df2)
df3

   Age    Name
0   33   Billy
1   31     Jin
2   21    Adam
3   26  Arnold
4   23    Alex
0   32   Alvin
1   39   Billy
2   27   Alvin
3   31    Alex
4   28  Andrew

In [97]:
# reset_index 인덱스 재정렬
df3.reset_index(drop=True, inplace = True)
df3.tail(2)

   Age    Name
8   31    Alex
9   28  Andrew

### 5. concat
   - row나 column으로 데이터 프레임을 합칠 때 사용

In [100]:
df3 = pd.concat([df1,df2]).reset_index(drop=True)
df3

   Age    Name
0   33   Billy
1   31     Jin
2   21    Adam
3   26  Arnold
4   23    Alex
5   32   Alvin
6   39   Billy
7   27   Alvin
8   31    Alex
9   28  Andrew

In [102]:
df3 = pd.concat([df1,df2],axis=1,join = "inner").reset_index(drop=True)
df3

   Age    Name  Age    Name
0   33   Billy   32   Alvin
1   31     Jin   39   Billy
2   21    Adam   27   Alvin
3   26  Arnold   31    Alex
4   23    Alex   28  Andrew

### 6. group by
   - 특정 컬럼의 중복되는 데이터를 합쳐서 새로운 데이터 프레임을 만드는 방법

In [103]:
df = pd.DataFrame(make_data())
df

   Age    Name
0   26     Jin
1   34     Jin
2   36  Anchal
3   32    Alan
4   27  Arnold
5   32    Alan
6   31  Anchal
7   20     Jin
8   32    Adam
9   37     Jin

In [107]:
#size
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

     Name  count
0    Adam      1
1    Alan      2
2  Anchal      2
3  Arnold      1
4     Jin      4

In [ ]:
# sort_values : 설정한 컬럼으로 데이터 프레임을 정렬

In [110]:
result_df.sort_values(["count"], ascending = False, inplace = True)
result_df.reset_index(drop=True, inplace = True)
result_df

     Name  count
0     Jin      4
1    Alan      2
2  Anchal      2
3    Adam      1
4  Arnold      1

In [111]:
# agg
# size(), min(), max(), mean()

In [114]:
df.groupby("Name").agg("min").reset_index()

     Name  Age
0    Adam   32
1    Alan   32
2  Anchal   31
3  Arnold   27
4     Jin   20

In [115]:
# 데이터를 요약해서 보여주는 함수
df.describe()

             Age
count  10.000000
mean   30.700000
std     5.100109
min    20.000000
25%    28.000000
50%    32.000000
75%    33.500000
max    37.000000